#ifndef DEFINES_H
#define DEFINES_H

#define VERSION "1.3"

/*

=== НОВОЕ В ВЕРСИИ 1.3 (08.06.2020) ===
    + Добавили возможность ограничить количество потоков скачивания
    + Сделали возможность несольких попыток скачивания в случае ошибки
    * Пофиксили продолжение установки и скачиваний при ошибках

=== НОВОЕ В ВЕРСИИ 1.2 (11.11.2019) ===
    + Сделали проверку доступа к директории
    * Инициализацию и проверку доступа к основным папкам вынесли отдельно
    * Теперь при ошибке не закрываем GUI, если было
    * Пофиксили логи - теперь пишется в один файл сразу в заданной папке, если задана и есть возможность

=== НОВОЕ В ВЕРСИИ 1.1 ===
    * Мелкие баг фиксы

=== НОВОЕ В ВЕРСИИ 1.0 ===
    + Базовая версия

*/

#endif // DEFINES_H
